import React from "react";
import { QuestionAccordion } from './../../app/faqs/page';

const CompetitionRulesAndFaqs = () => {


  const faqs = [
    {
      id: 1,
      question: "هل التسجيل مجاني أم يحتاج إلى رسوم؟",
      answer: "التسجيل في المنصة مجاني تماماً، بحيث يمكنك إنشاء حساب والاطلاع على معظم المحتوىات الأساسية بدون أي رسوم. ولكن بعض الدورات أو البرامج التدريبية المتقدمة قد تكون مدفوعة، وذلك لضمان جودة المحتوى واستمرارية المنصة. ومع ذلك، نوفر دائماً عدداً من الدورات المجانية ليتمكن الجميع من الاستفادة وتجربة المنصة قبل الاشتراك في البرامج المدفوعة.",
    },
    {
      id: 2,
      question: "هل التسجيل مجاني أم يحتاج إلى رسوم؟",
      answer: "التسجيل في المنصة مجاني تماماً، بحيث يمكنك إنشاء حساب والاطلاع على معظم المحتوىات الأساسية بدون أي رسوم. ولكن بعض الدورات أو البرامج التدريبية المتقدمة قد تكون مدفوعة، وذلك لضمان جودة المحتوى واستمرارية المنصة. ومع ذلك، نوفر دائماً عدداً من الدورات المجانية ليتمكن الجميع من الاستفادة وتجربة المنصة قبل الاشتراك في البرامج المدفوعة.",
    },
    {
      id: 3,
      question: "هل التسجيل مجاني أم يحتاج إلى رسوم؟",
      answer: "التسجيل في المنصة مجاني تماماً، بحيث يمكنك إنشاء حساب والاطلاع على معظم المحتوىات الأساسية بدون أي رسوم. ولكن بعض الدورات أو البرامج التدريبية المتقدمة قد تكون مدفوعة، وذلك لضمان جودة المحتوى واستمرارية المنصة. ومع ذلك، نوفر دائماً عدداً من الدورات المجانية ليتمكن الجميع من الاستفادة وتجربة المنصة قبل الاشتراك في البرامج المدفوعة.",
    },
   
  ];


  return (
    <div className="mt-[32px]">
      <div class="self-stretch text-center justify-center text-primary text-3xl font-bold ">
        قواعد المسابقة و االأسئلة الشائعة
      </div>

      <div className="flex items-center justify-center">

      <div className="container mx-auto px-[64px] mt-[32px] mb-[100px]">
        <div className="mt-8 flex flex-col gap-6">
          {faqs.map((item) => (
            <QuestionAccordion key={item.id} item={item} />
          ))}
        </div>
      </div>





      </div>
    </div>
  );
};

export default CompetitionRulesAndFaqs;
