import React from "react";
import { TargetStairs, TrophyIcon } from "../../public/svgs";
import Container from "../ui/Container";

const WhyChooseUs = () => {
  return (
    <div className="w-full  py-[40px] md:py-[133px] relative bg-[linear-gradient(to_bottom,#FFFFFF,#C2D8FC,#FDD4B7,#E9F4F3)] overflow-hidden">
      {/* <div className="w-px h-16 left-[811px] top-[133px] absolute" /> */}
      <Container className=" flex flex-col space-y-7 gap-4 md:flex-row justify-between ">
        <div className="flex justify-between flex-col md:flex-row gap-12">
          <div className="inline-flex flex-col justify-start items-start gap-6 md:gap-12">
            <div className=" text-text font-bold text-2xl sm:text-3xl lg:text-[40px] w-full  leading-normal relative items-center justify-center">
              لماذا تختارنا
            </div>
            <div className="flex flex-col justify-start items-start gap-4 md:gap-7 w-full md:w-auto">
              <div className="inline-flex justify-start items-center gap-6 w-full md:w-auto">
                <div className=" hidden md:flex opacity-20 justify-start text-emerald-950 text-[70px] font-medium  ">
                  01
                </div>
                <div className="p-6 bg-white/10 rounded-[30px] w-full md:w-auto shadow-[10px_25px_100px_0px_rgba(0,43,107,0.25)] outline outline-1 outline-offset-[-1px] outline-gray-100 flex  items-center gap-4">
                  <div className="p-4 bg-indigo-50 rounded-[43px] flex justify-center items-center gap-2.5 overflow-hidden">
                    <div className="w-6 h-6 relative overflow-hidden">
                      <svg
                        width={24}
                        height={25}
                        viewBox="0 0 24 25"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                      >
                        <g clipPath="url(#clip0_1159_4858)">
                          <path
                            fillRule="evenodd"
                            clipRule="evenodd"
                            d="M23.9766 11.9141C23.9766 12.1328 23.9766 12.3515 23.9766 12.5703C23.8697 12.8575 23.6822 13.084 23.4141 13.25C22.7332 13.5186 22.0457 13.7686 21.3516 14C20.6998 14.0825 20.2388 13.8247 19.9688 13.2266C20.0586 13.8088 19.9335 14.3401 19.5938 14.8203C19.1818 15.1876 18.7053 15.2969 18.1641 15.1484C18.0655 16.4895 17.3546 17.052 16.0312 16.8359C15.9927 17.9216 15.4223 18.5075 14.3203 18.5938C14.4215 19.5555 13.9918 20.1102 13.0312 20.2578C12.7273 20.2308 12.4461 20.137 12.1875 19.9766C11.6021 21.0153 10.813 21.2106 9.82031 20.5625C9.55261 20.3152 9.3495 20.0262 9.21094 19.6953C8.25839 19.9951 7.56305 19.6983 7.125 18.8047C6.42797 19.1645 5.77172 19.102 5.15625 18.6172C4.78294 18.1652 4.65015 17.6496 4.75781 17.0703C3.98892 17.1221 3.44985 16.7939 3.14062 16.0859C3.07051 15.7766 3.05489 15.4641 3.09375 15.1484C3.26362 14.7462 3.45893 14.3556 3.67969 13.9766C3.65625 13.961 3.63281 13.9453 3.60938 13.9297C3.39373 14.0875 3.15154 14.1656 2.88281 14.1641C2.0688 13.9839 1.27193 13.7417 0.492188 13.4375C0.269915 13.2657 0.09804 13.0547 -0.0234375 12.8047C-0.0234375 12.5703 -0.0234375 12.3359 -0.0234375 12.1016C0.787425 9.69228 1.57649 7.27044 2.34375 4.83594C2.63031 4.2669 3.09125 4.04034 3.72656 4.15625C4.45888 4.3691 5.17763 4.6191 5.88281 4.90625C6.12881 5.10913 6.28509 5.36694 6.35156 5.67969C6.43748 5.6953 6.52345 5.71095 6.60938 5.72656C7.49869 5.59137 8.38931 5.46636 9.28125 5.35156C10.0866 5.38044 10.8366 5.59916 11.5312 6.00781C12.6334 5.35203 13.7974 5.21923 15.0234 5.60938C15.5964 5.84112 16.1745 6.05989 16.7578 6.26562C16.8594 6.27345 16.9609 6.28123 17.0625 6.28906C17.1891 6.29417 17.3063 6.27073 17.4141 6.21875C17.2362 5.71156 17.3455 5.27403 17.7422 4.90625C18.5347 4.52968 19.355 4.225 20.2031 3.99219C20.7022 4.01499 21.0615 4.24936 21.2812 4.69531C22.1764 7.10802 23.0749 9.51425 23.9766 11.9141ZM20.1328 4.69531C20.3982 4.69896 20.5779 4.82396 20.6719 5.07031C21.5482 7.45569 22.431 9.83848 23.3203 12.2188C23.2958 12.409 23.2021 12.5496 23.0391 12.6406C22.3962 12.8862 21.7477 13.1127 21.0938 13.3203C20.8906 13.3203 20.75 13.2266 20.6719 13.0391C19.7754 10.637 18.8926 8.23072 18.0234 5.82031C18.0377 5.69019 18.0846 5.573 18.1641 5.46875C18.8231 5.20508 19.4794 4.94725 20.1328 4.69531ZM3.25781 4.83594C3.38378 4.82825 3.50878 4.83606 3.63281 4.85938C4.20803 5.05633 4.78617 5.24384 5.36719 5.42188C5.5305 5.51356 5.62425 5.65419 5.64844 5.84375C4.87833 8.31036 4.08926 10.7713 3.28125 13.2266C3.18246 13.3776 3.04184 13.4557 2.85938 13.4609C2.2242 13.2753 1.59139 13.0799 0.960938 12.875C0.780825 12.7887 0.671447 12.6481 0.632812 12.4531C1.41242 10.0049 2.20148 7.55961 3 5.11719C3.06374 4.99894 3.14967 4.90519 3.25781 4.83594ZM8.97656 6.05469C9.64697 6.00519 10.272 6.14581 10.8516 6.47656C10.0722 7.23242 9.29878 7.99808 8.53125 8.77344C8.37258 8.94767 8.23195 9.13517 8.10938 9.33594C8.03986 9.48603 8.0242 9.64231 8.0625 9.80469C8.92172 10.9555 10.0389 11.2915 11.4141 10.8125C12.0502 10.5803 12.6908 10.3616 13.3359 10.1562C13.6332 10.0663 13.9301 10.0663 14.2266 10.1562C15.5309 10.8318 16.8278 11.5193 18.1172 12.2188C18.4646 12.441 18.7849 12.6988 19.0781 12.9922C19.3875 13.4998 19.3485 13.9763 18.9609 14.4219C18.8631 14.4702 18.7615 14.5092 18.6562 14.5391C18.3697 14.4544 18.0962 14.3372 17.8359 14.1875C16.6566 13.5588 15.4847 12.9182 14.3203 12.2656C13.9063 12.1797 13.7422 12.3438 13.8281 12.7578C13.8672 12.7969 13.9063 12.836 13.9453 12.875C15.0426 13.4587 16.1285 14.0603 17.2031 14.6797C17.5917 15.2255 17.5214 15.702 16.9922 16.1094C16.7982 16.2063 16.595 16.2375 16.3828 16.2031C15.1809 15.5865 13.9778 14.9693 12.7734 14.3516C12.5451 14.3693 12.4201 14.4943 12.3984 14.7266C12.4235 14.8257 12.4703 14.9116 12.5391 14.9844C13.266 15.3869 14.0004 15.7775 14.7422 16.1562C15.4678 16.6881 15.4834 17.235 14.7891 17.7969C14.5746 17.8661 14.3558 17.8817 14.1328 17.8438C13.2988 17.4189 12.4706 16.9814 11.6484 16.5312C11.2013 16.3597 11.006 16.5081 11.0625 16.9766C11.1436 17.0758 11.2452 17.1461 11.3672 17.1875C11.1807 17.1541 10.9932 17.1619 10.8047 17.2109C10.7306 15.9706 10.0743 15.4081 8.83594 15.5234C8.72747 14.6024 8.21184 14.118 7.28906 14.0703C7.1677 14.0716 7.05052 14.0872 6.9375 14.1172C6.8092 13.3799 6.39516 12.8877 5.69531 12.6406C5.14702 12.5296 4.67045 12.6624 4.26562 13.0391C4.25978 12.705 4.30665 12.3769 4.40625 12.0547C5.02228 10.1675 5.62387 8.27689 6.21094 6.38281C6.56986 6.42739 6.92925 6.41956 7.28906 6.35938C7.85855 6.25939 8.42105 6.15786 8.97656 6.05469ZM13.5234 6.05469C13.8879 6.07484 14.2472 6.12955 14.6016 6.21875C15.3006 6.48242 16.0037 6.73241 16.7109 6.96875C17.0362 6.98263 17.3565 6.99045 17.6719 6.99219C18.3611 8.84703 19.0564 10.6986 19.7578 12.5469C19.7109 12.5781 19.6641 12.5781 19.6172 12.5469C19.0901 12.0178 18.4964 11.5804 17.8359 11.2344C16.6684 10.6272 15.4965 10.0334 14.3203 9.45312C13.8962 9.37072 13.4743 9.38633 13.0547 9.5C12.3642 9.72495 11.6767 9.95933 10.9922 10.2031C10.1193 10.4851 9.38494 10.2819 8.78906 9.59375C9.66563 8.57652 10.6188 7.63902 11.6484 6.78125C12.2159 6.3762 12.8408 6.13405 13.5234 6.05469ZM5.08594 13.3203C5.71458 13.2613 6.08958 13.5425 6.21094 14.1641C6.20194 14.2614 6.1785 14.3552 6.14062 14.4453C5.85938 14.9765 5.57812 15.5078 5.29688 16.0391C4.82812 16.5391 4.35938 16.5391 3.89062 16.0391C3.70972 15.7483 3.69409 15.4514 3.84375 15.1484C4.09375 14.6797 4.34375 14.2109 4.59375 13.7422C4.70944 13.5406 4.8735 13.4 5.08594 13.3203ZM7.05469 14.7734C7.78861 14.734 8.14017 15.0777 8.10938 15.8047C7.73962 16.5911 7.33336 17.3567 6.89062 18.1016C6.42544 18.4371 5.98795 18.4058 5.57812 18.0078C5.45677 17.8038 5.40989 17.585 5.4375 17.3516C5.78419 16.6426 6.14358 15.9395 6.51562 15.2422C6.64772 15.0237 6.82739 14.8674 7.05469 14.7734ZM9.11719 16.1797C9.77133 16.2165 10.0916 16.5603 10.0781 17.2109C9.82519 17.7324 9.55955 18.248 9.28125 18.7578C8.76113 19.2726 8.27677 19.2414 7.82812 18.6641C7.75894 18.4496 7.74328 18.2308 7.78125 18.0078C8.04689 17.5078 8.31248 17.0078 8.57812 16.5078C8.73108 16.3455 8.9108 16.2361 9.11719 16.1797ZM12.3984 17.7734C12.6928 17.9206 12.9897 18.0691 13.2891 18.2188C13.7499 18.593 13.7812 18.9993 13.3828 19.4375C13.0622 19.6033 12.7654 19.5642 12.4922 19.3203C12.7679 18.7819 12.7366 18.2663 12.3984 17.7734ZM10.9922 17.8672C11.3341 17.8702 11.6232 17.9952 11.8594 18.2422C12.013 18.544 11.9974 18.8408 11.8125 19.1328C11.6563 19.4141 11.5 19.6953 11.3438 19.9766C11.0588 20.296 10.7385 20.335 10.3828 20.0938C9.97814 19.8015 9.84534 19.4188 9.98438 18.9453C10.1317 18.5957 10.3426 18.291 10.6172 18.0312C10.7418 17.962 10.8668 17.9073 10.9922 17.8672Z"
                            fill="#3B82F6"
                          />
                        </g>
                        <defs>
                          <clipPath id="clip0_1159_4858">
                            <rect
                              width={24}
                              height={24}
                              fill="white"
                              transform="translate(0 0.5)"
                            />
                          </clipPath>
                        </defs>
                      </svg>
                    </div>
                  </div>
                  <div className="inline-flex flex-col   gap-1">
                    <div className="text-right justify-start text-text text-[15px] sm:text-[16px] font-bold   leading-7">
                      شريك التعلم الموثوق
                    </div>
                    <div className="text-right justify-start text-gray-600 text-[14px] sm:text-base font-normal  leading-normal">
                      دورات عالية الجودة من قبل مدرسين متخصصين
                    </div>
                  </div>
                </div>
              </div>
              <div className="inline-flex justify-start items-center gap-6 w-full md:w-auto">
                <div className="p-6 bg-white/10 rounded-[30px] w-full md:w-auto shadow-[10px_25px_100px_0px_rgba(0,43,107,0.25)] outline outline-1 outline-offset-[-1px] outline-gray-100 flex justify-start items-center gap-4">
                  <div className="inline-flex order-1 flex-col justify-center items-start gap-1">
                    <div className="text-right justify-start text-text text-[15px] sm:text-[16px] font-bold   leading-7">
                      مصممة خصيصًا لأهدافك
                    </div>
                    <div className=" w-full md:w-60 text-right justify-start text-[14px] sm:text-base font-normal  leading-normal">
                      مسارات تعليمية مرنة تناسب احتياجاتك
                    </div>
                  </div>
                  <div className="p-4 order-0 bg-yellow-100 rounded-[43px] flex justify-center items-center gap-2.5 overflow-hidden">
                    <div className="w-6 h-6 relative overflow-hidden">
                      <TargetStairs />
                    </div>
                  </div>
                </div>
                <div className=" hidden md:flex opacity-20 justify-start text-emerald-950 text-[70px] font-medium  ">
                  02
                </div>
              </div>

              <div className="inline-flex justify-start items-center gap-6 w-full mx:w-auto">
                <div className=" hidden md:flex opacity-20 justify-start text-emerald-950 text-[70px] font-medium  ">
                  03
                </div>
                <div className="p-6 bg-white/10 rounded-[30px] w-full md:w-auto shadow-[10px_25px_100px_0px_rgba(0,43,107,0.25)] outline outline-1 outline-offset-[-1px] outline-gray-100 flex justify-start items-center gap-4">
                  <div className="p-4 bg-orange-200 rounded-[43px] flex justify-center items-center gap-2.5 overflow-hidden">
                    <TrophyIcon />
                  </div>
                  <div className="inline-flex flex-col justify-start items-start gap-1">
                    <div className="w-32 text-right justify-start text-text text-[15px] sm:text-[16px] font-bold   leading-7">
                      النجاح المثبت
                    </div>
                    <div className="text-right justify-start text-gray-600 text-[14px] sm:text-base font-normal  leading-normal">
                      مساعدة المتعلمين على تحقيق أحلامهم
                    </div>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
        <div className="flex items-center justify-center">
          <img src="/images/Frame 1000004830.png" alt="" className="" />
        </div>
      </Container>
    </div>
  );
};

export default WhyChooseUs;
